{
  "_name_or_path": "/home/users/ntu/d230009/scratch/Target_Speaker_DiCoW/model/DiCoW",
  "activation_dropout": 0.0,
  "activation_function": "gelu",
  "additional_layer": false,
  "additional_self_attention_layer": true,
  "apply_fddt_to_n_layers": -1,
  "apply_spec_augment": false,
  "architectures": [
    "DiCoWForConditionalGeneration"
  ],
  "attention_dropout": 0.0,
  "auto_map": {
    "AutoConfig": "config.DiCoWConfig",
    "AutoModelForSpeechSeq2Seq": "modeling_dicow.DiCoWForConditionalGeneration"
  },
  
  "begin_suppress_tokens": [
    220,
    50256
  ],
  "blank_token_id": null,
  "bos_token_id": 50257,
  "classifier_proj_size": 256,
  "contrastive_loss_weight": 0,
  "ctc_loss_reduction": "mean",
  "ctc_weight": 0.3,
  "ctc_zero_infinity": false,
  "d_model": 1280,
  "decoder_attention_heads": 20,
  "decoder_ffn_dim": 5120,
  "decoder_layerdrop": 0.0,
  "decoder_layers": 4,
  "decoder_start_token_id": 50258,
  "dropout": 0.0,
  "encoder_attention_heads": 20,
  "encoder_ffn_dim": 5120,
  "encoder_layerdrop": 0.0,
  "encoder_layers": 32,
  "eos_token_id": 50257,
  "fddt_bias_only": false,
  "fddt_init": "disparagement",
  "fddt_is_diagonal": true,
  "fddt_use_non_target": true,
  "fddt_use_overlap": true,
  "fddt_use_silence": true,
  "fddt_use_target": true,
  "final_dropout": 0.0,
  "forced_decoder_ids": null,
  "init_std": 0.02,
  "is_encoder_decoder": true,
  "is_mt": false,
  "mask_feature_length": 10,
  "mask_feature_min_masks": 0,
  "mask_feature_prob": 0.0,
  "mask_time_length": 10,
  "mask_time_min_masks": 2,
  "mask_time_prob": 0.05,
  "max_source_positions": 1500,
  "max_target_positions": 448,
  "median_filter_width": 7,
  "model_type": "DiCoW",
  "mt_num_speakers": 1,
  "n_soft_prompts": 16,
  "non_target_fddt_value": 0.5,
  "num_hidden_layers": 32,
  "num_mel_bins": 128,
  "pad_token_id": 50257,
  "remove_timestamps_from_ctc": true,
  "scale_embedding": false,
  "scb_layers": -1,
  "scb_method": null,
  "sub_sample": true,
  "torch_dtype": "float32",
  "transformers_version": "4.42.0",
  "use_cache": true,
  "use_fddt": true,
  "use_initial_fddt": true,
  "use_weighted_layer_sum": false,
  "vocab_size": 51866
}
